driver-tests/bpelse/xslt/DoXslTransformJBI/test/partAsType1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsl="http://j2ee.netbeans.org/wsdl/XslPartAsType">
  <soapenv:Body>
    <xsl:XslPartAsTypeOperation>
      <part1>
        <EmployeeNumber>123</EmployeeNumber>
        <LastName>Smith</LastName>
        <FirstName>Bob</FirstName>
        <JobTitle>Code Monkey</JobTitle>
        <HoursWorked>60</HoursWorked>
        <PayRate>50</PayRate>
      </part1>
    </xsl:XslPartAsTypeOperation>
  </soapenv:Body>
</soapenv:Envelope>